Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_and_disability/job_interview_interpreter_grant_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Job Interview Interpreter Grant
ga: Scéim Deontais um Ateangaire ag Agallamh Poist

source: If you are attending a job interview and you are deaf or hard of hearing or have a speech impairment, you may benefit from having the services of an interpreter at the interview
ga: Má tá tú ag freastal ar agallamh agus tú bodhar nó lag ar éisteacht nó máchail chainte agat, d'fhéadfá buntáiste a bhaint as seirbhísí ateangaireachta ag an agallamh

source: The Job Interview Interpreter Grant allows anyone who is deaf, hard of hearing or has a significant speech impairment to have a professional interpreter provide services for him/her at a job interview
ga: Soláthraíonn an Scéim Deontais um Ateangaire ag Agallamh Poist deontas a cheadaíonn do dhaoine atá bodhar, a bhfuil lagú éisteachta nó máchail chainte shuntasach acu, ateangaire gairmiúil a fháil a sholáthróidh seirbhísí dó/di ag an agallamh le haghaidh poist

source: If you have just started work, you may also get this grant to cover the costs of an interpreter during an induction period
ga: Má thosaíonn tú ag obair, d’fhéadfá an deontas seo a fháil freisin chun costais ateangaire ar feadh tréimhse ionduchtúcháin a íoc

source: The grant is provided under the Department of Social Protection’s Reasonable Accommodation Fund
ga: Tá an deontas soláthartha ag an gCiste Freastal Réasúnta na Roinne Coimirce Sóisialaí

source: People who are deaf or hard of hearing communicate in a variety of ways, depending on a number of factors
ga: Déanann daoine atá bodhar nó a bhfuil lagú éisteachta acu cumarsáid ar mhórán bealaí, ag brath ar roinnt cúinsí

source: Examples of these factors include: the amount of residual hearing, the type of hearing impairment, language skills, the age when the impairment began, speech abilities, speech-reading skills, personality, intelligence, family environment, and educational background
ga: Samplaí de chuid de na cúinsí seo ná: an méid éisteachta iarmharaigh, an cineál lagéisteachta, scileanna teanga, aois inar thosnaigh an lagú, cumais urlabhra, scileanna urlabhra-léitheoireachta, pearsantacht, intleacht, timpeallacht teaghlaigh, agus cúlra oideachais

source: In an interview setting, the use of an interpreter can help you express your thoughts clearly and concisely
ga: Le linn agallaimh, is féidir le hateangaire cuidiú leat do chuid smaointe a chur in iúl go soiléir agus gonta

source: Interpreters who are used during job interviews are not permitted to participate in the conversation and they view all information exchanged as confidential
ga: Ní ceadmhach d'ateangairí a úsáidtear le linn agallaimh le haghaidh poist páirt a ghlacadh sa chomhrá agus glactar leis go bhfuil an fhaisnéis ar fad a mhalartaítear rúnda

source: Nothing is added or deleted from any interaction between you and the interview board that takes place
ga: Ní chuirtear ná ní bhaintear aon ní ón idirghabháil a thiteann amach idir tú féin agus an bord agallaimh

source: This document describes the Job Interview Interpreter Grant and provides some general guidelines for employers and employees before and during the interview
ga: Cuireann an doiciméad seo síos ar an Scéim Deontais um Ateangaire ag Agallamh Poist agus soláthraíonn sé treoirlínte ginearálta d'fhostóirí agus d'fhostaithe roimh agus le linn an agallaimh

source: Advice for employees at the interview
ga: Comhairle d'fhostaithe ag an agallamh

source: It is advisable to arrange interpreter services as far in advance of the interview date as possible
ga: Moltar duit seirbhísí ateangaireachta a eagrú tamall maith roimh dháta féidearthach an agallaimh

source: This will allow you both to make contact and discuss any specific requirements (for example, a presentation) that may be a requirement of the interview process
ga: Ceadóidh sé seo don bheirt agaibh teagmháil agus plé a dhéanamh ar riachtanais ar leith (.i., cuir i láthair, srl.) go bhféadfaí a bheith mar riachtanas de chuid an phróisis agallaimh

source: Ensure that your interpreter has a copy of your curriculum vitae (CV) in advance of the interview and that you are both familiar and comfortable with any specific terminology or vocabulary that may be used during the discussion
ga: Cinntigh go bhfuil cóip de do CV ag an ateangaire roimh an agallaimh agus go bhfuil taithí ag an an bheirt agaibh ar théarmaíocht nó foclaíocht ar leith ar bith go bhféadfaí a úsáid le linn an chomhrá, agus sibh compordach leo

source: Contact the employer in advance of the interview to let him/her know the name of your interpreter and finalise all arrangements
ga: Déan teagmháil leis an bhfostóir roimh an agallaimh chun ainm an ateangaire a chur in iúl dóibh agus na socruithe ar fad a chur i gcrích

source: Advice for employers at the interview:
ga: Comhairle d'fhostóirí ag an agallamh

source: Interpreters have to be able to translate in both directions on the spot
ga: Caithfidh ateangairí a bheith ábalta aistriú sa dhá threo ar an bpointe

source: There are two types of interpreting: consecutive and simultaneous
ga: Tá dhá chineál ateangaireachta ann: iaruaineach agus comhuaineach

source: During consecutive interpreting, the speaker should stop every 1-5 minutes (usually at the end of every "paragraph" or a complete thought) and the interpreter then renders what was said in the target language (for example, speech or sign language)
ga: Le linn ateangaireachta iaruaineach, ba chóir don gcainteoir stopadh gach 1-5 nóiméad (go hiondúil ag deireadh gach "ailt" nó smaoineamh iomlán) agus soláthraíonn an ateangaire an méid a bhí ráite sa sprioctheanga (.i., labhartha nó teanga chomharthaíochta)

source: During simultaneous interpreting, the interpreter will begin to translate a few seconds after the speaker commences speaking
ga: Le linn ateangaireachta comhuaineach, tosóidh an ateangaire ag aistriú cúpla soicind tar éis don gcainteoir tosú ag caint

source: The type of interpreting used during the interview will depend on a number of issues (for example, the complexity of the subject matter being discussed)
ga: Beidh an cineál ateangaireachta úsáidte le linn an agallaimh ag brath ar roinnt ceisteanna (mar shampla, deacracht an ábhair idir láimhe, srl.)

source: Consecutive interpreting is more often used during interviews and in question-and-answer sessions, but a mix of consecutive and simultaneous may be used (depending on appropriateness)
ga: Tá ateangaireacht iaruaineach úsáidte níos minice le linn agallaimh agus seisiúin ceisteanna agus freagraí, ach d'fhéadfaí meascán d'iaruaineach agus comhuaineach a úsáid (ag brath ar oiriúnacht)

source: You should speak directly to the person who is deaf or is hard of hearing (the interviewee), not the interpreter. You should maintain eye contact with the interviewee to convey a feeling of direct communication
ga: Ba chóir duit labhairt go díreach leis an duine atá bodhar nó a bhfuil lagú éisteachta acu (an t-agallaí), agus ní leis an ateangaire

source: The interpreter should stand or sit near the speaker, while the person with the hearing impairment should be near the interpreter and have a clear view
ga: Ba chóir duit amharc sna súile leis an agallaí a choinneáil chun mothú cumarsáide díreach a chur in iúl

source: The interpreter should stand or sit near the speaker, while the person who is deaf or hard of hearing should be near the interpreter and have a clear view
ga: Ba chóir don ateangaire seasamh nó suí in aice leis an gcainteoir, agus an duine atá bodhar nó lag ar éisteacht a bheith in aice leis an ateangaire agus ábalta feiceáil go soiléir

source: If the interviewer plans on moving around the area or if there will be multiple interviewers, the interviewee should ask the interpreter and interviewer before the interview where the best seating will be
ga: Má tá sé i gceist ag an agallóir bogadh thart laistigh den limistéar nó má bhíonn ilagallóirí i gceist, ba chóir don agallaí iarraidh ar an ateangaire agus ar an agallóir cén áit is fearr le suí

source: Remember that the interpreter is a few words behind the speaker
ga: Cuimhnigh go bhfuil an ateangaire cúpla focail taobh thiar den gcainteoir

source: Give enough time to finish before you continue so that the person who is deaf or hard of hearing can ask questions or join in the discussion
ga: Tabhair go leor ama le críochnú roimh leanacht ar aghaidh ionas gur féidir leis an duine atá bodhar nó a bhfuil lagú éisteachta aige ceisteanna a iarraidh nó teacht isteach ar an gcomhrá

source: The interpreter or the person who is deaf or hard of hearing may ask you to slow down or repeat a word or sentence for clarification
ga: D'fhéadfadh an ateangaire nó an duine atá bodhar nó a bhfuil lagú éisteachta acu iarraidh ort moilliú síos nó focal nó abairt a athrá chun soiléiriú a fháil

source: Likewise, be sure to ask for something to be repeated if it is unclear
ga: Mar an gcéanna, bí cinnte iarraidh maidir le rud a athrá mura bhfuil sé soiléir

source: You should never ever ask the interpreter to "tell him/her..." as this is considered disrespectful and rude
ga: Níor chóir duit iarraidh ar an ateangaire riamh "abair léi/leis..." mar breathnaítear ar seo mar easpa ómóis agus dhrochbhéasa

source: When speaking to someone who is deaf or hard of hearing or has a speech impairment, you should speak normally
ga: Nuair atá tú ag labhairt le duine atá bodhar nó a bhfuil lagú éisteachta nó a bhfuil máchail chainte acu, ba chóir duit labhairt mar is gnáth leat

source: Speaking loudly does not help, especially if there is an interpreter present
ga: Ní chuidíonn sé labhairt os ard, go háirithe má tá ateangaire i láthair

source: Remember to always speak directly to (and face) the interviewee - not the interpreter
ga: Cuimhnigh i gcónaí labhairt go díreach leis (agus os comhair) an agallaí - ní leis an ateangaire

source: Allow the interviewee to complete his/her sentences
ga: Ceadaigh don agallaí a c(h)uid abairtí a chríochnú

source: It is important to remember that people with language or speech impairments often have different speech patterns so you will need to listen attentively
ga: Tá sé tábhachtach a mheabhrú go bhfuil patrúin cainte difriúla ag daoine le máchail chainte nó theanga - dá bhrí seo is gá duit éisteacht go géar

source: If you do not understand what was said, ask questions and repeat them to make sure you are clear
ga: Mura dtuigeann tú céard a bhí ráite, iarr ceisteanna agus déan iad a athrá chun cinntiú go bhfuil tú soiléir

source: If you are attending the interview, you will need to source and select the interpreter that will accompany you to the interview
ga: Má tá tú ag freastal ar agallamh, beidh gá agat ateangaire a fhoinsiú agus a roghnú a bheidh mar thionlacan agat le linn an agallaimh

source: While the interpreter can be a friend, colleague or family member, it is advised that you seek a professionally qualified interpreter
ga: Cé gur féidir leis an ateangaire a bheith ina c(h)ara, ina c(h)omhleacaí, nó ball teaghlaigh, moltar duit ateangaire cáilithe gairmiúil a lorg

source: If you will be attending more than one interview, you can apply to have an interpreter present for each interview
ga: Más amhlaidh go mbeidh tú ag freastal ar níos mó ná agallamh amháin, is féidir leat iarratas a dhéanamh go mbeidh ateangaire i láthair ag gach agallamh

source: The number of interviews at which you can attend with an interpreter is unlimited
ga: Tá líon na n-agallamh gur féidir leat freastal orthu le hateangaire neamhtheoranta

source: If you are unable to source an interpreter, you can request interpretation services through the Sign Language Interpreting Service - see 'Where to apply' below
ga: Mura bhfuil tú ábalta teacht ar ateangaire, is féidir leat iarratas a dhéanamh ar sheirbhísí ateangaireachta trí Seirbhís Teangaireachta Teanga Comharthaíochta - féach 'Cá háit a dhéanfaidh mé iarratas' thíos

source: Public sector employers (government departments, State agencies, Local Health Offices, local authorities, etc.) are obliged to facilitate the needs of their staff with disabilties
ga: Tá dualgas ar fhostóirí na hearnála poiblí (ranna rialtais, gníomhaireachtaí Stáit, Limistéir Fheidhmeannacht na Seirbhíse (FSS), údaráis áitiúla, srl.) riachtanais a gcuid baill fhoirne atá faoi mhíchumas a éascú

source: This means making assistive technology, adaptive equipment and facilities, aids, appliances and services available to their employees with disabilities
ga: Ciallaíonn sé seo teicneolaíocht cúnta, trealamh agus áiseanna oiriúnaitheacha, gléasanna agus seirbhísí eile a chur ar fáil dá bhfostaithe atá faoi mhíchumas

source: If you are already a public sector employee and will be attending an interview within the public sector, you should be aware that public sector employers are obliged to ensure interpretation services are made available to you if you request them
ga: Más fostaí den earnáil phoiblí tú agus má bhíonn tú ag freastal ar agallamh laistigh den earnáil phoiblí, ba chóir duit a bheith ar an airdeall go bhfuil dualgas ar fhostóirí na hearnála poiblí a chinntiú go gcuirtear seirbhísí ateangaireachta ar fáil duit má dhéanann tú iarratas orthu

source: You are therefore not entitled to claim the Job Interview Interpreter Grant
ga: Ní bheifeá i dteideal mar sin éileamh a dhéanamh ar Dheontas Ateangaire Scéim Deontais um Ateangaire ag Agallamh Poist

source: If you are attending an interview or a number of interviews to become an employee in the public sector, you are entitled to apply for the Job Interview Interpreter Grant
ga: Má tá tú ag freastal ar agallamh nó líon agallaimh le bheith i d'fhostaí de chuid na hearnála phoiblí, tá tú i dteideal iarratas a dhéanamh ar Dheontas um Ateangaire ag Agallamh Poist

source: You should be aware, however, that in advance of your interview, you will most likely be contacted by your prospective public sector employer and asked if you have any special needs
ga: Cibé ar bith, ba chóir duit a bheith airdeall go bhfuil seans maith go ndéanfaidh d'fhostóir ionchais de chuid na hearnála phoiblí teagmháil leat roimh an agallaimh, chun iarraidh ort faoi riachtanais speisialta ar bith atá agat

source: At this stage, you can request that interpreter services be made available to you or you can apply for the grant and arrange your own interpreter
ga: Ag an staid seo, is féidir leat iarratas a dhéanamh go gcuirfí seirbhísí ateangaireachta ar fáil duit nó is féidir leat iarratas ar dheontas agus ateangaire a eagrú duit féin

source: The Department of Social Protection will pay a fee as per the standard rate for a 3-hour period using a professionally qualified interpreter
ga: Íocfaidh an Roinn Coimirce Sóisialaí táille de réir an ghnathráta do thréimhse trí uair a' chloig ag baint úsáide as ateangaire cáilithe gairmiúil

source: Travel costs for the interpreter are paid at a set rate
ga: Íoctar costais taistil an ateangaire ag ráta socraithe atá leagtha síos

source: Interpreter rates may vary
ga: D’fhéadfadh rátaí idirdhealú ateangairí athrú

source: Rates will be differentiated between professionally qualified interpreters and others
ga: Déantar na rátaí idirdhealú idir ateangairí cáilithe gairmiúil agus ateangairí eile

source: If you are attending a job interview, you should contact your local employment services office to obtain Part 1 (pdf) and Part 2 (pdf) of the Reasonable Accommodation Fund application form, which is also available online
ga: Má tá tú ag freastal ar agallamh le haghaidh poist, ba chóir duit teagmháil a dhéanamh le d'oifig seirbhísí fostaíochta áitiúil chun Cuid 1 (pdf) agus Cuid 2 (pdf) den fhoirm iarratais an Chiste Freastal Réasúnta atá le fáil ar líne, a aimsiú

source: Complete the application form (if you have any difficulties in completing the application form, the staff in your local employment services office will help you)
ga: Comhlánaigh an fhoirm iarratais (má tá aon deacrachtaí agat an fhoirm iarratais a chomhlánú, cuideoidh baill fhoirne ó d'oifig seirbhísí fostaíochta áitiúil leat)

source: Bring your application form to the interview where it will be signed and stamped by the employer and your interpreter
ga: Tabhair d'fhoirm iarratais chuig an agallamh, áit a dhéanfaidh d'fhostóir agus d'ateangaire í a shíniú agus a stampáil

source: When you return the signed and stamped application form to your local employment services office, the payment will be made directly to the interpreter
ga: Nuair a sheolann tú an fhoirm iarratais sínithe agus stampáilte ar ais ag d'oifig seirbhísí fostaíochta áitiúil, déanfar íocaíocht go díreach leis an ateangaire

source: Guidelines on the Job Interview Interpreter Grant (pdf) are available on welfare.ie. Where to apply
ga: Cá háit a ndéanfaidh mé iarratas

source: Contact your local employment services office or Intreo centre
ga: Déan teagmháil le d'oifig seirbhísí fostaíochta áitiúil nó ionad Intreo
